Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/atdf/PIC32MZ1024EFE064.atdf
      <value-group caption="Interrupt Proximity Timer Control bits" name="INTCON__TPC">
         <value caption="Interrupts of group priority 7 or lower start the Interrupt Proximity timer" name="" value="0x7"/>
         <value caption="Interrupts of group priority 6 or lower start the Interrupt Proximity timer" name="" value="0x6"/>
         <value caption="Interrupts of group priority 5 or lower start the Interrupt Proximity timer" name="" value="0x5"/>
         <value caption="Interrupts of group priority 4 or lower start the Interrupt Proximity timer" name="" value="0x4"/>
         <value caption="Interrupts of group priority 3 or lower start the Interrupt Proximity timer" name="" value="0x3"/>
         <value caption="Interrupts of group priority 2 or lower start the Interrupt Proximity timer" name="" value="0x2"/>
         <value caption="Interrupts of group priority 1 start the Interrupt Proximity timer" name="" value="0x1"/>
         <value caption="Disables Interrupt Proximity timer" name="" value="0x0"/>
      </value-group>
      <value-group caption="Multi Vector Configuration bit" name="INTCON__MVEC">
         <value caption="Interrupt controller configured for multi vectored mode" name="" value="0x1"/>
         <value caption="Interrupt controller configured for single vectored mode" name="" value="0x0"/>
      </value-group>
      <value-group caption="Single Vector Shadow Register Set bit" name="PRISS__SS0">
         <value caption="Single vector is presented with a shadow set" name="" value="0x1"/>
         <value caption="Single vector is not presented with a shadow set" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 1 Shadow Set bits " name="PRISS__PRI1SS">
         <value caption="Reserved (by default" name="" value="1xxx"/>
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 7" name="" value="0x7"/>
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 6" name="" value="0x6"/>
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 1" name="" value="0x1"/>
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 2 Shadow Set bits " name="PRISS__PRI2SS">
         <value caption="Reserved (by default" name="" value="1xxx"/>
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 7" name="" value="0x7"/>
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 6" name="" value="0x6"/>
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 1" name="" value="0x1"/>
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 3 Shadow Set bits " name="PRISS__PRI3SS">
         <value caption="Reserved (by default" name="" value="1xxx"/>
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 7" name="" value="0x7"/>
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 6" name="" value="0x6"/>
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 1" name="" value="0x1"/>
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 4 Shadow Set bits " name="PRISS__PRI4SS">
         <value caption="Reserved (by default" name="" value="1xxx"/>
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 7" name="" value="0x7"/>
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 6" name="" value="0x6"/>
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 1" name="" value="0x1"/>
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 5 Shadow Set bits " name="PRISS__PRI5SS">
         <value caption="Reserved (by default" name="" value="1xxx"/>
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 7" name="" value="0x7"/>
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 6" name="" value="0x6"/>
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 1" name="" value="0x1"/>
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 6 Shadow Set bits " name="PRISS__PRI6SS">
         <value caption="Reserved (by default" name="" value="1xxx"/>
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 7" name="" value="0x7"/>
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 6" name="" value="0x6"/>
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 1" name="" value="0x1"/>
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Interrupt with Priority Level 7 Shadow Set bits " name="PRISS__PRI7SS">
         <value caption="Reserved (by default" name="" value="1xxx"/>
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 7" name="" value="0x7"/>
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 6" name="" value="0x6"/>
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 1" name="" value="0x1"/>
         <value caption="Interrupt with a priority level of 7 uses Shadow Set 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Requested Priority Level bits for Single Vector Mode bits " name="INTSTAT__SRIPL">
         <value caption="The priority level of the latest interrupt presented to the CPU" name="" value="111-000"/>
      </value-group>
   </module>
