Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.39/atdf/PIC32MZ1024EFE064.atdf
      <value-group caption="Start of Frame Interrupt bit" name="USBCSR2__SOFIF">
         <value caption="A new frame has started" name="" value="0x1"/>
         <value caption="No start of frame detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Device Connection Interrupt bit" name="USBCSR2__CONNIF">
         <value caption="In Host mode" name="" value="0x1"/>
         <value caption="No device connection detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Device Disconnect Interrupt bit" name="USBCSR2__DISCONIF">
         <value caption="In Host mode" name="" value="0x1"/>
         <value caption="No device disconnect detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Session Request Interrupt bit" name="USBCSR2__SESSRQIF">
         <value caption="Session request signaling has been detected" name="" value="0x1"/>
         <value caption="No session request detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Vbus Error Interrupt bit" name="USBCSR2__VBUSERRIF">
         <value caption="Vbus has dropped below the Vbus valid threshold during a session" name="" value="0x1"/>
         <value caption="No interrupt" name="" value="0x0"/>
      </value-group>
      <value-group caption="Suspend Interrupt Enable bit" name="USBCSR2__SUSPIE">
         <value caption="Suspend signaling interrupt is enabled" name="" value="0x1"/>
         <value caption="Suspend signaling interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Resume Interrupt Enable bit" name="USBCSR2__RESUMEIE">
         <value caption="Resume signaling interrupt is enabled" name="" value="0x1"/>
         <value caption="Resume signaling interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reset/Babble Interrupt Enable bit" name="USBCSR2__RESETIE">
         <value caption="Interrupt when reset (" name="" value="0x1"/>
         <value caption="Reset/Babble interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Start of Frame Interrupt Enable bit" name="USBCSR2__SOFIE">
         <value caption="Start of Frame event interrupt is enabled" name="" value="0x1"/>
         <value caption="Start of Frame event interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Device Connection Interrupt Enable bit" name="USBCSR2__CONNIE">
         <value caption="Device connection interrupt is enabled" name="" value="0x1"/>
         <value caption="Device connection interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Device Disconnect Interrupt Enable bit" name="USBCSR2__DISCONIE">
         <value caption="Device disconnect interrupt is enabled" name="" value="0x1"/>
         <value caption="Device disconnect interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Session Request Interrupt Enable bit" name="USBCSR2__SESSRQIE">
         <value caption="Session request interrupt is enabled" name="" value="0x1"/>
         <value caption="Session request interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Vbus Error Interrupt Enable bit" name="USBCSR2__VBUSERRIE">
         <value caption="Vbus error interrupt is enabled" name="" value="0x1L"/>
         <value caption="Vbus error interrupt is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="Endpoint Registers Select bits" name="USBCSR3__ENDPOINT">
         <value caption="Reserved" name="" value="0xf"/>
         <value caption="Reserved" name="" value="0xe"/>
         <value caption="Reserved" name="" value="0xd"/>
         <value caption="Reserved" name="" value="0xc"/>
         <value caption="Reserved" name="" value="0xb"/>
         <value caption="Reserved" name="" value="0xa"/>
         <value caption="Reserved" name="" value="0x9"/>
         <value caption="Reserved" name="" value="0x8"/>
         <value caption="Endpoint 7" name="" value="0x7"/>
         <value caption="Endpoint 6" name="" value="0x6"/>
         <value caption="Endpoint 5" name="" value="0x5"/>
         <value caption="Endpoint 4" name="" value="0x4"/>
         <value caption="Endpoint 3" name="" value="0x3"/>
         <value caption="Endpoint 2" name="" value="0x2"/>
         <value caption="Endpoint 1" name="" value="0x1"/>
         <value caption="Endpoint 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Test_SE0_NAK Test Mode Select bit" name="USBCSR3__NAK">
         <value caption="Enter Test_SE0_NAK test mode. The USB module remains in Hi-Speed mode but responds to any valid IN token with a NAK" name="" value="0x1"/>
         <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Test_J Test Mode Select bit" name="USBCSR3__TESTJ">
         <value caption="Enters Test_J test mode. The USB module transmits a continuous J on the bus." name="" value="0x1"/>
         <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Test_K Test Mode Select bit" name="USBCSR3__TESTK">
         <value caption="Enters Test_K test mode. The USB module transmits a continuous K on the bus." name="" value="0x1"/>
         <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Test_Packet Test Mode Select bit" name="USBCSR3__PACKET">
         <value caption="The USB module repetitively transmits on the bus a 53-byte test packet. Test packet must be loaded into the Endpoint 0 FIFO before the test mode is entered." name="" value="0x1"/>
         <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Test mode Force Hi-Speed Mode Select bit" name="USBCSR3__FORCEHS">
         <value caption="Forces USB module into Hi-Speed mode. Undefined behavior if FORCEFS = 1." name="" value="0x1"/>
         <value caption="If FORCEFS is 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Test mode Force Full-Speed Mode Select bit" name="USBCSR3__FORCEFS">
         <value caption="Forces USB module into Full-Speed mode. Undefined behavior if FORCEHS is 1" name="" value="0x1"/>
         <value caption="(If FORCEHS is 0): places USB module into Low-Speed mode." name="" value="0x0"/>
      </value-group>
      <value-group caption="Test Mode Endpoint 0 FIFO Transfer Force bit" name="USBCSR3__FIFOACC">
         <value caption="Transfers the packet in the Endpoint 0 TX FIFO to the Endpoint 0 RX FIFO" name="" value="0x1"/>
         <value caption="No transfer" name="" value="0x0"/>
      </value-group>
